day-09/day-09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-27 Fri 20:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="vincent" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcca1cf5">1. Spacemacs Rocks Season 2(Day-09)</a>
<ul>
<li><a href="#org768ac72">1.1. What is macro?</a>
<ul>
<li><a href="#org981067c">1.1.1. What's the different between function and macro?</a></li>
<li><a href="#orgded4864">1.1.2. Evaluation: the macro arguments are the actual expressions appearning in the macro call.</a></li>
<li><a href="#org26fa88a">1.1.3. Expansion: the value returned by the macro body is an alternate Lisp expression, also known as the expansion of the macro</a></li>
<li><a href="#org0e74c94">1.1.4. Examples</a></li>
</ul>
</li>
<li><a href="#org368d030">1.2. Use-package and basic usage</a>
<ul>
<li><a href="#org99e1b1d">1.2.1. A more safe require</a></li>
<li><a href="#orgdea2f21">1.2.2. Group config into ine place</a></li>
<li><a href="#org1cbc095">1.2.3. Autoload and bind keys easily</a></li>
<li><a href="#orgf3d4d17">1.2.4. Make your config load faster</a></li>
<li><a href="#org4dd5c52">1.2.5. And more? Spacemacs use it a lot</a></li>
</ul>
</li>
<li><a href="#org0447d35">1.3. Bonus Time</a></li>
<li><a href="#org13ff5c0">1.4. Reference</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcca1cf5" class="outline-2">
<h2 id="orgcca1cf5"><span class="section-number-2">1</span> Spacemacs Rocks Season 2(Day-09)</h2>
<div class="outline-text-2" id="text-1">
<p>
Topic: Macro and Use-package
</p>
</div>

<div id="outline-container-org768ac72" class="outline-3">
<h3 id="org768ac72"><span class="section-number-3">1.1</span> What is macro?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Code which generate code?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> <span style="color: #50fa7b; font-weight: bold;">inc</span> (var)
  (list 'setq var (list '1+ var)))

(<span style="color: #ff79c6; font-weight: bold;">setq</span> my-var 1)
(macroexpand '(inc my-var))
</pre>
</div>

<p>
Write macro is almost the same as writing function in elisp
</p>
</div>

<div id="outline-container-org981067c" class="outline-4">
<h4 id="org981067c"><span class="section-number-4">1.1.1</span> What's the different between function and macro?</h4>
</div>
<div id="outline-container-orgded4864" class="outline-4">
<h4 id="orgded4864"><span class="section-number-4">1.1.2</span> Evaluation: the macro arguments are the actual expressions appearning in the macro call.</h4>
</div>
<div id="outline-container-org26fa88a" class="outline-4">
<h4 id="org26fa88a"><span class="section-number-4">1.1.3</span> Expansion: the value returned by the macro body is an alternate Lisp expression, also known as the expansion of the macro</h4>
</div>
<div id="outline-container-org0e74c94" class="outline-4">
<h4 id="org0e74c94"><span class="section-number-4">1.1.4</span> Examples</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
back quote matters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(sp-local-pair 'emacs-lisp-mode <span style="color: #f1fa8c;">"`"</span> nil <span style="color: #ffb86c;">:actions</span> nil)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">my-print</span> (number)
  (message <span style="color: #f1fa8c;">"This is a number: %s"</span> number))

(my-print 2)
(my-print (+ 2 3))

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">===</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">=== back quote</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">===</span>
(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> <span style="color: #50fa7b; font-weight: bold;">my-print-mac</span> (number)
  `(message <span style="color: #f1fa8c;">"%s"</span> ,number))

(my-print-mac 2)
(my-print-mac (+ 2 3)) <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">ok</span>


(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> <span style="color: #50fa7b; font-weight: bold;">inc</span> (var)
  (list 'setq var (list '1+ var)))

(<span style="color: #ff79c6; font-weight: bold;">setq</span> my-var 2)
(inc my-var)

(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> <span style="color: #50fa7b; font-weight: bold;">inc-2</span> (var1 var2)
  (list 'progn (list 'inc var1) (list 'inc var2)))

(macroexpand '(inc-2 my-var my-var))
(macroexpand-all '(inc-2 my-var my-var))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org368d030" class="outline-3">
<h3 id="org368d030"><span class="section-number-3">1.2</span> Use-package and basic usage</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org99e1b1d" class="outline-4">
<h4 id="org99e1b1d"><span class="section-number-4">1.2.1</span> A more safe require</h4>
</div>
<div id="outline-container-orgdea2f21" class="outline-4">
<h4 id="orgdea2f21"><span class="section-number-4">1.2.2</span> Group config into ine place</h4>
</div>
<div id="outline-container-org1cbc095" class="outline-4">
<h4 id="org1cbc095"><span class="section-number-4">1.2.3</span> Autoload and bind keys easily</h4>
</div>
<div id="outline-container-orgf3d4d17" class="outline-4">
<h4 id="orgf3d4d17"><span class="section-number-4">1.2.4</span> Make your config load faster</h4>
</div>
<div id="outline-container-org4dd5c52" class="outline-4">
<h4 id="org4dd5c52"><span class="section-number-4">1.2.5</span> And more? Spacemacs use it a lot</h4>
</div>
</div>

<div id="outline-container-org0447d35" class="outline-3">
<h3 id="org0447d35"><span class="section-number-3">1.3</span> Bonus Time</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>pretty print the lisp Object</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(pp (macroexpand '(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #8be9fd;">company-mode</span>)))

</pre>
</div>
<ul class="org-ul">
<li>fuck your brain?</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> <span style="color: #50fa7b; font-weight: bold;">defsynonym</span> (old-name new-name)
  `(<span style="color: #ff79c6; font-weight: bold;">defmacro</span> ,new-name (<span style="color: #bd93f9;">&amp;rest</span> args)
     `(, ',old-name ,@args)))

</pre>
</div>

<p>
more discussion: <a href="https://emacs-china.org/t/lisp/357">https://emacs-china.org/t/lisp/357</a>
</p>
</div>
</div>

<div id="outline-container-org13ff5c0" class="outline-3">
<h3 id="org13ff5c0"><span class="section-number-3">1.4</span> Reference</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Read more about macro: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Macros.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Macros.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: vincent</p>
<p class="date">Created: 2020-03-27 Fri 20:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
